app/controllers/products_controller.rb

  def index
    # @products = Product.page(params[:page])
    @products = Product.all
---
SELECT "products".* FROM "products"